src/InformationRegisters/Напоминания/Напоминания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Напоминания</name>
  <resources>
    <name>ДатаВремяНапоминания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Завершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Задачи</types>
      <types>CatalogRef.Заметки</types>
      <types>CatalogRef.Проекты</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОписанияПоОбъектам/ОписанияПоОбъектам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОписанияПоОбъектам</name>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Заметки</types>
      <types>CatalogRef.Задачи</types>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Описание</name>
    <type>
      <types>CatalogRef.Описания</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/ОбщегоНазначенияВызовСервера/Module.bsl
Функция ПредставлениеЗамера(Замер) Экспорт
	
	Возврат Справочники.Замеры.ПредставлениеЗамера(Замер);
	
КонецФункции

Процедура СоздатьОтложитьНапоминания(Дата, ОбъектыНапоминаний) Экспорт
	
	РегистрыСведений.Напоминания.СоздатьОтложитьНапоминание(Дата, ОбъектыНапоминаний);
	
КонецПроцедуры

Процедура ЗавершитьНапоминания(ОбъектыНапоминаний) Экспорт
	
	РегистрыСведений.Напоминания.ЗавершитьНапоминания(ОбъектыНапоминаний);
	
КонецПроцедуры

Функция ДанныеОписания(Объект) Экспорт
	
	Результат = РегистрыСведений.ОписанияПоОбъектам.ДанныеОписания(Объект);
	
	Возврат Результат;
	
КонецФункции

Процедура СвязатьОписаниеСОбъектом(Описание, Объект) Экспорт
	
	РегистрыСведений.ОписанияПоОбъектам.СвязатьОписаниеСОбъектом(Описание, Объект);
	
КонецПроцедуры

Процедура УдалитьОписание(Объект) Экспорт
	
	РегистрыСведений.ОписанияПоОбъектам.ОтвязатьОписаниеОтОбъекта(Объект);
	
КонецПроцедуры
